Hello @sondrelg I couldn't reproduce your error, this is what I got where running terraform plan with your config

```hcl
# module.eks.module.promtail.module.helm_addon.helm_release.addon[0] will be created
  + resource "helm_release" "addon" {
      + atomic                     = false
      + chart                      = "promtail"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + description                = "Promtail helm Chart deployment configuration"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "promtail"
      + namespace                  = "promtail"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = [
          + <<-EOT
                config:
                  clients:
                    - url: https://url-to-another-cluster.com/loki/api/v1/push
            EOT,
        ]
      + verify                     = false
      + version                    = "6.3.0"
      + wait                       = true
      + wait_for_jobs              = false

      + postrender {}
    }

````

and as you can see the pod is using `https://url-to-another-cluster.com/loki/api/v1/push` as url  in the log file below
[promtail-xq9xv.log](https://github.com/aws-ia/terraform-aws-eks-blueprints/files/9496441/promtail-xq9xv.log)

Can you open an issue and share the terraform plan section of `resource "helm_release" "addon" ` so that we can see the plan content ?
